Extensions installed on WSL: Ubuntu:
austin.code-gnu-global
ChakrounAnas.turbo-console-log
chekweitan.compare-view
cschlosser.doxdocgen
dzhavat.bracket-pair-toggler
esbenp.prettier-vscode
GitHub.copilot
HookyQR.beautify
jeff-hykin.better-cpp-syntax
jeffersonlicet.snipped
jevakallio.vscode-live-frame
MeshIntelligentTechnologiesInc.pieces-vscode
mintlify.document
misogi.ruby-rubocop
mitaki28.vscode-clang
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vsliveshare.vsliveshare
rangav.vscode-thunder-client
ritwickdey.LiveServer
rvest.vs-code-prettier-eslint
Shopify.rubocop-lsp
TabNine.tabnine-vscode
twxs.cmake
xaver.clang-format
zengxingxin.sort-js-object-keys
